import {типВидео} from "./схемы";

export const бд: {видео: типВидео[]} = {
    видео: [
        {
            ид: 0,
            название: "Электрон",
            автор: "Ландау",
            можноСкачать: true,
            минВозрастноеОграничение: null,
            созданВ: "2024-05-27T17:30:34.279Z",
            датаПубликации: "2024-05-27T17:30:34.279Z",
            доступныеРазрешения: ["P144"]
        }, {
            ид: 1,
            название: "Протон",
            автор: "Ландау",
            можноСкачать: true,
            минВозрастноеОграничение: 12,
            созданВ: "2024-05-27T17:30:34.279Z",
            датаПубликации: "2024-05-27T17:30:34.279Z",
            доступныеРазрешения: ["P144", "P240"]
        }, {
            ид: 2,
            название: "Нейтрон",
            автор: "Ландау",
            можноСкачать: true,
            минВозрастноеОграничение: 16,
            созданВ: "2024-05-27T17:30:34.279Z",
            датаПубликации: "2024-05-27T17:30:34.279Z",
            доступныеРазрешения: ["P144", "P240", "P360"]
        }, {
            ид: 3,
            название: "Фотон",
            автор: "Ландау",
            можноСкачать: false,
            минВозрастноеОграничение: 18,
            созданВ: "2024-05-27T17:30:34.279Z",
            датаПубликации: "2024-05-27T17:30:34.279Z",
            доступныеРазрешения: ["P144", "P240", "P360", "P480"]
        }
    ] // Задание массива видео
}; // Объявление базы данных
